Model: "Modele_SpeechReco_1600542624"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_40 (InputLayer)           [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_42 (Conv2D)              (None, 517, 13, 128) 768         input_40[0][0]                   
__________________________________________________________________________________________________
batch_normalization_42 (BatchNo (None, 517, 13, 128) 512         conv2d_42[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_42 (MaxPooling2D) (None, 259, 7, 128)  0           batch_normalization_42[0][0]     
__________________________________________________________________________________________________
conv2d_43 (Conv2D)              (None, 259, 7, 64)   41024       max_pooling2d_42[0][0]           
__________________________________________________________________________________________________
batch_normalization_43 (BatchNo (None, 259, 7, 64)   256         conv2d_43[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_43 (MaxPooling2D) (None, 130, 4, 64)   0           batch_normalization_43[0][0]     
__________________________________________________________________________________________________
conv2d_44 (Conv2D)              (None, 130, 4, 1)    321         max_pooling2d_43[0][0]           
__________________________________________________________________________________________________
batch_normalization_44 (BatchNo (None, 130, 4, 1)    4           conv2d_44[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_44 (MaxPooling2D) (None, 65, 2, 1)     0           batch_normalization_44[0][0]     
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 65, 2)        0           max_pooling2d_44[0][0]           
__________________________________________________________________________________________________
bidirectional_23 (Bidirectional [(None, 65, 256), (N 135168      squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
dropout_23 (Dropout)            (None, 65, 256)      0           bidirectional_23[0][0]           
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_24 (Bidirectional [(None, 65, 256), (N 395264      dropout_23[0][0]                 
                                                                 bidirectional_23[0][1]           
                                                                 bidirectional_23[0][3]           
                                                                 bidirectional_23[0][2]           
                                                                 bidirectional_23[0][4]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 100)     5100        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_57 (TensorFl [(None, 256)]        0           bidirectional_24[0][1]           
                                                                 bidirectional_24[0][3]           
__________________________________________________________________________________________________
tf_op_layer_concat_58 (TensorFl [(None, 256)]        0           bidirectional_24[0][2]           
                                                                 bidirectional_24[0][4]           
__________________________________________________________________________________________________
cu_dnnlstm_54 (CuDNNLSTM)       [(None, 150, 256), ( 366592      decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_57[0][0]      
                                                                 tf_op_layer_concat_58[0][0]      
__________________________________________________________________________________________________
cu_dnnlstm_55 (CuDNNLSTM)       [(None, 150, 256), ( 526336      cu_dnnlstm_54[0][0]              
                                                                 cu_dnnlstm_54[0][1]              
                                                                 cu_dnnlstm_54[0][2]              
__________________________________________________________________________________________________
additive_attention_10 (Additive (None, 150, 256)     0           cu_dnnlstm_55[0][0]              
                                                                 bidirectional_24[0][0]           
__________________________________________________________________________________________________
tf_op_layer_concat_59 (TensorFl [(None, 150, 512)]   0           additive_attention_10[0][0]      
                                                                 cu_dnnlstm_55[0][0]              
__________________________________________________________________________________________________
time_distributed_67 (TimeDistri (None, 150, 128)     65664       tf_op_layer_concat_59[0][0]      
__________________________________________________________________________________________________
time_distributed_68 (TimeDistri (None, 150, 64)      8256        time_distributed_67[0][0]        
__________________________________________________________________________________________________
time_distributed_69 (TimeDistri (None, 150, 32)      2080        time_distributed_68[0][0]        
__________________________________________________________________________________________________
time_distributed_70 (TimeDistri (None, 150, 51)      1683        time_distributed_69[0][0]        
==================================================================================================
Total params: 1,549,028
Trainable params: 1,548,642
Non-trainable params: 386
__________________________________________________________________________________________________
