Model: "Modele_SpeechReco_1600543878"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_4 (InputLayer)            [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 517, 13, 128) 768         input_4[0][0]                    
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 517, 13, 128) 512         conv2d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 259, 7, 128)  0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 259, 7, 64)   41024       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 259, 7, 64)   256         conv2d_4[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 130, 4, 64)   0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 130, 4, 1)    321         max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 130, 4, 1)    4           conv2d_5[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 65, 2, 1)     0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 65, 2)        0           max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) [(None, 65, 256), (N 135168      squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 65, 256)      0           bidirectional_2[0][0]            
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_3 (Bidirectional) [(None, 65, 256), (N 395264      dropout_2[0][0]                  
                                                                 bidirectional_2[0][1]            
                                                                 bidirectional_2[0][3]            
                                                                 bidirectional_2[0][2]            
                                                                 bidirectional_2[0][4]            
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 100)     5100        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_3 (TensorFlo [(None, 256)]        0           bidirectional_3[0][1]            
                                                                 bidirectional_3[0][3]            
__________________________________________________________________________________________________
tf_op_layer_concat_4 (TensorFlo [(None, 256)]        0           bidirectional_3[0][2]            
                                                                 bidirectional_3[0][4]            
__________________________________________________________________________________________________
cu_dnnlstm_6 (CuDNNLSTM)        [(None, 150, 256), ( 366592      decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_3[0][0]       
                                                                 tf_op_layer_concat_4[0][0]       
__________________________________________________________________________________________________
cu_dnnlstm_7 (CuDNNLSTM)        [(None, 150, 256), ( 526336      cu_dnnlstm_6[0][0]               
                                                                 cu_dnnlstm_6[0][1]               
                                                                 cu_dnnlstm_6[0][2]               
__________________________________________________________________________________________________
additive_attention_1 (AdditiveA (None, 150, 256)     0           cu_dnnlstm_7[0][0]               
                                                                 bidirectional_3[0][0]            
__________________________________________________________________________________________________
tf_op_layer_concat_5 (TensorFlo [(None, 150, 512)]   0           additive_attention_1[0][0]       
                                                                 cu_dnnlstm_7[0][0]               
__________________________________________________________________________________________________
time_distributed_4 (TimeDistrib (None, 150, 128)     65664       tf_op_layer_concat_5[0][0]       
__________________________________________________________________________________________________
time_distributed_5 (TimeDistrib (None, 150, 64)      8256        time_distributed_4[0][0]         
__________________________________________________________________________________________________
time_distributed_6 (TimeDistrib (None, 150, 32)      2080        time_distributed_5[0][0]         
__________________________________________________________________________________________________
time_distributed_7 (TimeDistrib (None, 150, 51)      1683        time_distributed_6[0][0]         
==================================================================================================
Total params: 1,549,028
Trainable params: 1,548,642
Non-trainable params: 386
__________________________________________________________________________________________________
