Model: "Modele_SpeechReco_1599569441"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_4 (InputLayer)            [(None, 264600)]     0                                            
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 1, 264600)    0           input_4[0][0]                    
__________________________________________________________________________________________________
mel_stft (Melspectrogram)       (None, 80, 2068, 1)  1091664     reshape_1[0][0]                  
__________________________________________________________________________________________________
mel_stft_norm (Normalization2D) (None, 80, 2068, 1)  0           mel_stft[0][0]                   
__________________________________________________________________________________________________
permute_1 (Permute)             (None, 2068, 80, 1)  0           mel_stft_norm[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 2068, 80, 20) 120         permute_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 2068, 80, 20) 80          conv2d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 1034, 40, 20) 0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 1034, 40, 10) 1010        max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 1034, 40, 10) 40          conv2d_4[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 517, 20, 10)  0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 517, 20, 1)   51          max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 517, 20, 1)   4           conv2d_5[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 259, 10, 1)   0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 259, 10)      0           max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) [(None, 259, 16), (N 1216        squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 32)      1632        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_3 (TensorFlo [(None, 16)]         0           bidirectional_1[0][1]            
                                                                 bidirectional_1[0][3]            
__________________________________________________________________________________________________
tf_op_layer_concat_4 (TensorFlo [(None, 16)]         0           bidirectional_1[0][2]            
                                                                 bidirectional_1[0][4]            
__________________________________________________________________________________________________
lstm_3 (LSTM)                   [(None, 150, 16), (N 3136        decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_3[0][0]       
                                                                 tf_op_layer_concat_4[0][0]       
__________________________________________________________________________________________________
additive_attention_1 (AdditiveA (None, 150, 16)      0           lstm_3[0][0]                     
                                                                 bidirectional_1[0][0]            
__________________________________________________________________________________________________
tf_op_layer_concat_5 (TensorFlo [(None, 150, 32)]    0           additive_attention_1[0][0]       
                                                                 lstm_3[0][0]                     
__________________________________________________________________________________________________
time_distributed_3 (TimeDistrib (None, 150, 32)      1056        tf_op_layer_concat_5[0][0]       
__________________________________________________________________________________________________
time_distributed_4 (TimeDistrib (None, 150, 16)      528         time_distributed_3[0][0]         
__________________________________________________________________________________________________
time_distributed_5 (TimeDistrib (None, 150, 51)      867         time_distributed_4[0][0]         
==================================================================================================
Total params: 1,101,404
Trainable params: 9,678
Non-trainable params: 1,091,726
__________________________________________________________________________________________________
