Model: "Modele_SpeechReco_1600533306"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_22 (InputLayer)           [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 517, 13, 100) 600         input_22[0][0]                   
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 517, 13, 100) 400         conv2d_20[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_20 (MaxPooling2D) (None, 259, 7, 100)  0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 259, 7, 1)    501         max_pooling2d_20[0][0]           
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 259, 7, 1)    4           conv2d_21[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_21 (MaxPooling2D) (None, 130, 4, 1)    0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 130, 4)       0           max_pooling2d_21[0][0]           
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_10 (Bidirectional [(None, 130, 512), ( 536576      squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 100)     5100        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_30 (TensorFl [(None, 512)]        0           bidirectional_10[0][1]           
                                                                 bidirectional_10[0][3]           
__________________________________________________________________________________________________
tf_op_layer_concat_31 (TensorFl [(None, 512)]        0           bidirectional_10[0][2]           
                                                                 bidirectional_10[0][4]           
__________________________________________________________________________________________________
cu_dnnlstm_22 (CuDNNLSTM)       [(None, 150, 512), ( 1257472     decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_30[0][0]      
                                                                 tf_op_layer_concat_31[0][0]      
__________________________________________________________________________________________________
cu_dnnlstm_23 (CuDNNLSTM)       [(None, 150, 512), ( 2101248     cu_dnnlstm_22[0][0]              
                                                                 cu_dnnlstm_22[0][1]              
                                                                 cu_dnnlstm_22[0][2]              
__________________________________________________________________________________________________
additive_attention_1 (AdditiveA (None, 150, 512)     0           cu_dnnlstm_23[0][0]              
                                                                 bidirectional_10[0][0]           
__________________________________________________________________________________________________
tf_op_layer_concat_32 (TensorFl [(None, 150, 1024)]  0           additive_attention_1[0][0]       
                                                                 cu_dnnlstm_23[0][0]              
__________________________________________________________________________________________________
time_distributed_31 (TimeDistri (None, 150, 64)      65600       tf_op_layer_concat_32[0][0]      
__________________________________________________________________________________________________
time_distributed_32 (TimeDistri (None, 150, 32)      2080        time_distributed_31[0][0]        
__________________________________________________________________________________________________
time_distributed_33 (TimeDistri (None, 150, 32)      1056        time_distributed_32[0][0]        
__________________________________________________________________________________________________
time_distributed_34 (TimeDistri (None, 150, 51)      1683        time_distributed_33[0][0]        
==================================================================================================
Total params: 3,972,320
Trainable params: 3,972,118
Non-trainable params: 202
__________________________________________________________________________________________________
