Model: "Modele_SpeechReco_1600541266"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_36 (InputLayer)           [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 517, 13, 128) 768         input_36[0][0]                   
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (None, 517, 13, 128) 512         conv2d_36[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_36 (MaxPooling2D) (None, 259, 7, 128)  0           batch_normalization_36[0][0]     
__________________________________________________________________________________________________
conv2d_37 (Conv2D)              (None, 259, 7, 64)   41024       max_pooling2d_36[0][0]           
__________________________________________________________________________________________________
batch_normalization_37 (BatchNo (None, 259, 7, 64)   256         conv2d_37[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_37 (MaxPooling2D) (None, 130, 4, 64)   0           batch_normalization_37[0][0]     
__________________________________________________________________________________________________
conv2d_38 (Conv2D)              (None, 130, 4, 1)    321         max_pooling2d_37[0][0]           
__________________________________________________________________________________________________
batch_normalization_38 (BatchNo (None, 130, 4, 1)    4           conv2d_38[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_38 (MaxPooling2D) (None, 65, 2, 1)     0           batch_normalization_38[0][0]     
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 65, 2)        0           max_pooling2d_38[0][0]           
__________________________________________________________________________________________________
bidirectional_19 (Bidirectional [(None, 65, 256), (N 135168      squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
dropout_19 (Dropout)            (None, 65, 256)      0           bidirectional_19[0][0]           
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_20 (Bidirectional [(None, 65, 256), (N 395264      dropout_19[0][0]                 
                                                                 bidirectional_19[0][1]           
                                                                 bidirectional_19[0][3]           
                                                                 bidirectional_19[0][2]           
                                                                 bidirectional_19[0][4]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 100)     5100        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_51 (TensorFl [(None, 256)]        0           bidirectional_20[0][1]           
                                                                 bidirectional_20[0][3]           
__________________________________________________________________________________________________
tf_op_layer_concat_52 (TensorFl [(None, 256)]        0           bidirectional_20[0][2]           
                                                                 bidirectional_20[0][4]           
__________________________________________________________________________________________________
cu_dnnlstm_46 (CuDNNLSTM)       [(None, 150, 256), ( 366592      decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_51[0][0]      
                                                                 tf_op_layer_concat_52[0][0]      
__________________________________________________________________________________________________
cu_dnnlstm_47 (CuDNNLSTM)       [(None, 150, 256), ( 526336      cu_dnnlstm_46[0][0]              
                                                                 cu_dnnlstm_46[0][1]              
                                                                 cu_dnnlstm_46[0][2]              
__________________________________________________________________________________________________
additive_attention_8 (AdditiveA (None, 150, 256)     0           cu_dnnlstm_47[0][0]              
                                                                 bidirectional_20[0][0]           
__________________________________________________________________________________________________
tf_op_layer_concat_53 (TensorFl [(None, 150, 512)]   0           additive_attention_8[0][0]       
                                                                 cu_dnnlstm_47[0][0]              
__________________________________________________________________________________________________
time_distributed_59 (TimeDistri (None, 150, 128)     65664       tf_op_layer_concat_53[0][0]      
__________________________________________________________________________________________________
time_distributed_60 (TimeDistri (None, 150, 64)      8256        time_distributed_59[0][0]        
__________________________________________________________________________________________________
time_distributed_61 (TimeDistri (None, 150, 32)      2080        time_distributed_60[0][0]        
__________________________________________________________________________________________________
time_distributed_62 (TimeDistri (None, 150, 51)      1683        time_distributed_61[0][0]        
==================================================================================================
Total params: 1,549,028
Trainable params: 1,548,642
Non-trainable params: 386
__________________________________________________________________________________________________
