Model: "Modele_SpeechReco_1600546278"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_12 (InputLayer)           [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 517, 13, 128) 768         input_12[0][0]                   
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 517, 13, 128) 512         conv2d_15[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_15 (MaxPooling2D) (None, 259, 7, 128)  0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 259, 7, 64)   41024       max_pooling2d_15[0][0]           
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 259, 7, 64)   256         conv2d_16[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_16 (MaxPooling2D) (None, 130, 4, 64)   0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 130, 4, 1)    321         max_pooling2d_16[0][0]           
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 130, 4, 1)    4           conv2d_17[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_17 (MaxPooling2D) (None, 65, 2, 1)     0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 65, 2)        0           max_pooling2d_17[0][0]           
__________________________________________________________________________________________________
bidirectional_10 (Bidirectional [(None, 65, 256), (N 135168      squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, 65, 256)      0           bidirectional_10[0][0]           
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_11 (Bidirectional [(None, 65, 256), (N 395264      dropout_10[0][0]                 
                                                                 bidirectional_10[0][1]           
                                                                 bidirectional_10[0][3]           
                                                                 bidirectional_10[0][2]           
                                                                 bidirectional_10[0][4]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 100)     5100        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_15 (TensorFl [(None, 256)]        0           bidirectional_11[0][1]           
                                                                 bidirectional_11[0][3]           
__________________________________________________________________________________________________
tf_op_layer_concat_16 (TensorFl [(None, 256)]        0           bidirectional_11[0][2]           
                                                                 bidirectional_11[0][4]           
__________________________________________________________________________________________________
cu_dnnlstm_22 (CuDNNLSTM)       [(None, 150, 256), ( 366592      decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_15[0][0]      
                                                                 tf_op_layer_concat_16[0][0]      
__________________________________________________________________________________________________
cu_dnnlstm_23 (CuDNNLSTM)       [(None, 150, 256), ( 526336      cu_dnnlstm_22[0][0]              
                                                                 cu_dnnlstm_22[0][1]              
                                                                 cu_dnnlstm_22[0][2]              
__________________________________________________________________________________________________
additive_attention_5 (AdditiveA (None, 150, 256)     0           cu_dnnlstm_23[0][0]              
                                                                 bidirectional_11[0][0]           
__________________________________________________________________________________________________
tf_op_layer_concat_17 (TensorFl [(None, 150, 512)]   0           additive_attention_5[0][0]       
                                                                 cu_dnnlstm_23[0][0]              
__________________________________________________________________________________________________
time_distributed_20 (TimeDistri (None, 150, 128)     65664       tf_op_layer_concat_17[0][0]      
__________________________________________________________________________________________________
time_distributed_21 (TimeDistri (None, 150, 64)      8256        time_distributed_20[0][0]        
__________________________________________________________________________________________________
time_distributed_22 (TimeDistri (None, 150, 32)      2080        time_distributed_21[0][0]        
__________________________________________________________________________________________________
time_distributed_23 (TimeDistri (None, 150, 51)      1683        time_distributed_22[0][0]        
==================================================================================================
Total params: 1,549,028
Trainable params: 1,548,642
Non-trainable params: 386
__________________________________________________________________________________________________
