Model: "Modele_SpeechReco_1600541160"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_34 (InputLayer)           [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 517, 13, 128) 768         input_34[0][0]                   
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 517, 13, 128) 512         conv2d_33[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_33 (MaxPooling2D) (None, 259, 7, 128)  0           batch_normalization_33[0][0]     
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 259, 7, 64)   41024       max_pooling2d_33[0][0]           
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 259, 7, 64)   256         conv2d_34[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_34 (MaxPooling2D) (None, 130, 4, 64)   0           batch_normalization_34[0][0]     
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 130, 4, 1)    321         max_pooling2d_34[0][0]           
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, 130, 4, 1)    4           conv2d_35[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_35 (MaxPooling2D) (None, 65, 2, 1)     0           batch_normalization_35[0][0]     
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 65, 2)        0           max_pooling2d_35[0][0]           
__________________________________________________________________________________________________
bidirectional_17 (Bidirectional [(None, 65, 256), (N 135168      squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
dropout_17 (Dropout)            (None, 65, 256)      0           bidirectional_17[0][0]           
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_18 (Bidirectional [(None, 65, 256), (N 395264      dropout_17[0][0]                 
                                                                 bidirectional_17[0][1]           
                                                                 bidirectional_17[0][3]           
                                                                 bidirectional_17[0][2]           
                                                                 bidirectional_17[0][4]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 100)     5100        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_48 (TensorFl [(None, 256)]        0           bidirectional_18[0][1]           
                                                                 bidirectional_18[0][3]           
__________________________________________________________________________________________________
tf_op_layer_concat_49 (TensorFl [(None, 256)]        0           bidirectional_18[0][2]           
                                                                 bidirectional_18[0][4]           
__________________________________________________________________________________________________
cu_dnnlstm_42 (CuDNNLSTM)       [(None, 150, 256), ( 366592      decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_48[0][0]      
                                                                 tf_op_layer_concat_49[0][0]      
__________________________________________________________________________________________________
cu_dnnlstm_43 (CuDNNLSTM)       [(None, 150, 256), ( 526336      cu_dnnlstm_42[0][0]              
                                                                 cu_dnnlstm_42[0][1]              
                                                                 cu_dnnlstm_42[0][2]              
__________________________________________________________________________________________________
additive_attention_7 (AdditiveA (None, 150, 256)     0           cu_dnnlstm_43[0][0]              
                                                                 bidirectional_18[0][0]           
__________________________________________________________________________________________________
tf_op_layer_concat_50 (TensorFl [(None, 150, 512)]   0           additive_attention_7[0][0]       
                                                                 cu_dnnlstm_43[0][0]              
__________________________________________________________________________________________________
time_distributed_55 (TimeDistri (None, 150, 128)     65664       tf_op_layer_concat_50[0][0]      
__________________________________________________________________________________________________
time_distributed_56 (TimeDistri (None, 150, 64)      8256        time_distributed_55[0][0]        
__________________________________________________________________________________________________
time_distributed_57 (TimeDistri (None, 150, 32)      2080        time_distributed_56[0][0]        
__________________________________________________________________________________________________
time_distributed_58 (TimeDistri (None, 150, 51)      1683        time_distributed_57[0][0]        
==================================================================================================
Total params: 1,549,028
Trainable params: 1,548,642
Non-trainable params: 386
__________________________________________________________________________________________________
