Model: "Modele_SpeechReco_1600098794"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 264600)]     0                                            
__________________________________________________________________________________________________
reshape (Reshape)               (None, 1, 264600)    0           input_2[0][0]                    
__________________________________________________________________________________________________
mel_stft (Melspectrogram)       (None, 80, 2068, 1)  1091664     reshape[0][0]                    
__________________________________________________________________________________________________
mel_stft_norm (Normalization2D) (None, 80, 2068, 1)  0           mel_stft[0][0]                   
__________________________________________________________________________________________________
permute (Permute)               (None, 2068, 80, 1)  0           mel_stft_norm[0][0]              
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 2068, 80, 20) 120         permute[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 2068, 80, 20) 80          conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 1034, 40, 20) 0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 1034, 40, 1)  101         max_pooling2d[0][0]              
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 1034, 40, 1)  4           conv2d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 517, 20, 1)   0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 517, 20)      0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional (Bidirectional)   [(None, 517, 64), (N 13568       squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 50)      2550        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat (TensorFlowO [(None, 64)]         0           bidirectional[0][1]              
                                                                 bidirectional[0][3]              
__________________________________________________________________________________________________
tf_op_layer_concat_1 (TensorFlo [(None, 64)]         0           bidirectional[0][2]              
                                                                 bidirectional[0][4]              
__________________________________________________________________________________________________
lstm_1 (LSTM)                   [(None, 150, 64), (N 29440       decoder_embedding[0][0]          
                                                                 tf_op_layer_concat[0][0]         
                                                                 tf_op_layer_concat_1[0][0]       
__________________________________________________________________________________________________
additive_attention (AdditiveAtt (None, 150, 64)      0           lstm_1[0][0]                     
                                                                 bidirectional[0][0]              
__________________________________________________________________________________________________
tf_op_layer_concat_2 (TensorFlo [(None, 150, 128)]   0           additive_attention[0][0]         
                                                                 lstm_1[0][0]                     
__________________________________________________________________________________________________
time_distributed (TimeDistribut (None, 150, 32)      4128        tf_op_layer_concat_2[0][0]       
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 150, 32)      1056        time_distributed[0][0]           
__________________________________________________________________________________________________
time_distributed_2 (TimeDistrib (None, 150, 51)      1683        time_distributed_1[0][0]         
==================================================================================================
Total params: 1,144,394
Trainable params: 52,688
Non-trainable params: 1,091,706
__________________________________________________________________________________________________
