Model: "Modele_SpeechReco_1600462198"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_4 (InputLayer)            [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 517, 13, 20)  120         input_4[0][0]                    
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 517, 13, 20)  80          conv2d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 259, 7, 20)   0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 259, 7, 1)    101         max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 259, 7, 1)    4           conv2d_4[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 130, 4, 1)    0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 130, 4, 1)    6           max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 130, 4, 1)    4           conv2d_5[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 65, 2, 1)     0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 65, 2)        0           max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) [(None, 65, 16), (No 704         squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 65, 16)       0           bidirectional_2[0][0]            
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_3 (Bidirectional) [(None, 65, 16), (No 1600        dropout_2[0][0]                  
                                                                 bidirectional_2[0][1]            
                                                                 bidirectional_2[0][3]            
                                                                 bidirectional_2[0][2]            
                                                                 bidirectional_2[0][4]            
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 50)      2550        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_3 (TensorFlo [(None, 16)]         0           bidirectional_3[0][1]            
                                                                 bidirectional_3[0][3]            
__________________________________________________________________________________________________
tf_op_layer_concat_4 (TensorFlo [(None, 16)]         0           bidirectional_3[0][2]            
                                                                 bidirectional_3[0][4]            
__________________________________________________________________________________________________
lstm_5 (LSTM)                   [(None, 150, 16), (N 4288        decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_3[0][0]       
                                                                 tf_op_layer_concat_4[0][0]       
__________________________________________________________________________________________________
dot_2 (Dot)                     (None, 150, 65)      0           lstm_5[0][0]                     
                                                                 bidirectional_3[0][0]            
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 150, 65)      0           dot_2[0][0]                      
__________________________________________________________________________________________________
dot_3 (Dot)                     (None, 150, 16)      0           activation_1[0][0]               
                                                                 bidirectional_3[0][0]            
__________________________________________________________________________________________________
tf_op_layer_concat_5 (TensorFlo [(None, 150, 32)]    0           dot_3[0][0]                      
                                                                 lstm_5[0][0]                     
__________________________________________________________________________________________________
time_distributed_3 (TimeDistrib (None, 150, 32)      1056        tf_op_layer_concat_5[0][0]       
__________________________________________________________________________________________________
time_distributed_4 (TimeDistrib (None, 150, 32)      1056        time_distributed_3[0][0]         
__________________________________________________________________________________________________
time_distributed_5 (TimeDistrib (None, 150, 51)      1683        time_distributed_4[0][0]         
==================================================================================================
Total params: 13,252
Trainable params: 13,208
Non-trainable params: 44
__________________________________________________________________________________________________
