Model: "Modele_SpeechReco_1600459560"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 517, 13, 20)  120         input_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 517, 13, 20)  80          conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 259, 7, 20)   0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 259, 7, 1)    101         max_pooling2d[0][0]              
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 259, 7, 1)    4           conv2d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 130, 4, 1)    0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 130, 4, 1)    6           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 130, 4, 1)    4           conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 65, 2, 1)     0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 65, 2)        0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
bidirectional (Bidirectional)   [(None, 65, 16), (No 704         squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
dropout (Dropout)               (None, 65, 16)       0           bidirectional[0][0]              
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) [(None, 65, 16), (No 1600        dropout[0][0]                    
                                                                 bidirectional[0][1]              
                                                                 bidirectional[0][3]              
                                                                 bidirectional[0][2]              
                                                                 bidirectional[0][4]              
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 50)      2550        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat (TensorFlowO [(None, 16)]         0           bidirectional_1[0][1]            
                                                                 bidirectional_1[0][3]            
__________________________________________________________________________________________________
tf_op_layer_concat_1 (TensorFlo [(None, 16)]         0           bidirectional_1[0][2]            
                                                                 bidirectional_1[0][4]            
__________________________________________________________________________________________________
lstm_2 (LSTM)                   [(None, 150, 16), (N 4288        decoder_embedding[0][0]          
                                                                 tf_op_layer_concat[0][0]         
                                                                 tf_op_layer_concat_1[0][0]       
__________________________________________________________________________________________________
dot (Dot)                       (None, 150, 65)      0           lstm_2[0][0]                     
                                                                 bidirectional_1[0][0]            
__________________________________________________________________________________________________
activation (Activation)         (None, 150, 65)      0           dot[0][0]                        
__________________________________________________________________________________________________
dot_1 (Dot)                     (None, 150, 16)      0           activation[0][0]                 
                                                                 bidirectional_1[0][0]            
__________________________________________________________________________________________________
tf_op_layer_concat_2 (TensorFlo [(None, 150, 32)]    0           dot_1[0][0]                      
                                                                 lstm_2[0][0]                     
__________________________________________________________________________________________________
time_distributed (TimeDistribut (None, 150, 32)      1056        tf_op_layer_concat_2[0][0]       
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 150, 32)      1056        time_distributed[0][0]           
__________________________________________________________________________________________________
time_distributed_2 (TimeDistrib (None, 150, 51)      1683        time_distributed_1[0][0]         
==================================================================================================
Total params: 13,252
Trainable params: 13,208
Non-trainable params: 44
__________________________________________________________________________________________________
