Model: "Modele_SpeechReco_1599952941"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_14 (InputLayer)           [(None, 264600)]     0                                            
__________________________________________________________________________________________________
reshape (Reshape)               (None, 1, 264600)    0           input_14[0][0]                   
__________________________________________________________________________________________________
mel_stft (Melspectrogram)       (None, 80, 2068, 1)  1091664     reshape[0][0]                    
__________________________________________________________________________________________________
mel_stft_norm (Normalization2D) (None, 80, 2068, 1)  0           mel_stft[0][0]                   
__________________________________________________________________________________________________
permute (Permute)               (None, 2068, 80, 1)  0           mel_stft_norm[0][0]              
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 2068, 80, 20) 120         permute[0][0]                    
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 2068, 80, 20) 80          conv2d_12[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_12 (MaxPooling2D) (None, 1034, 40, 20) 0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 1034, 40, 1)  101         max_pooling2d_12[0][0]           
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 1034, 40, 1)  4           conv2d_13[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_13 (MaxPooling2D) (None, 517, 20, 1)   0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 517, 20)      0           max_pooling2d_13[0][0]           
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_6 (Bidirectional) [(None, 517, 32), (N 4736        squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 32)      1632        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_18 (TensorFl [(None, 32)]         0           bidirectional_6[0][1]            
                                                                 bidirectional_6[0][3]            
__________________________________________________________________________________________________
tf_op_layer_concat_19 (TensorFl [(None, 32)]         0           bidirectional_6[0][2]            
                                                                 bidirectional_6[0][4]            
__________________________________________________________________________________________________
lstm_13 (LSTM)                  [(None, 150, 32), (N 8320        decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_18[0][0]      
                                                                 tf_op_layer_concat_19[0][0]      
__________________________________________________________________________________________________
additive_attention_6 (AdditiveA (None, 150, 32)      0           lstm_13[0][0]                    
                                                                 bidirectional_6[0][0]            
__________________________________________________________________________________________________
tf_op_layer_concat_20 (TensorFl [(None, 150, 64)]    0           additive_attention_6[0][0]       
                                                                 lstm_13[0][0]                    
__________________________________________________________________________________________________
time_distributed_18 (TimeDistri (None, 150, 32)      2080        tf_op_layer_concat_20[0][0]      
__________________________________________________________________________________________________
time_distributed_19 (TimeDistri (None, 150, 16)      528         time_distributed_18[0][0]        
__________________________________________________________________________________________________
time_distributed_20 (TimeDistri (None, 150, 51)      867         time_distributed_19[0][0]        
==================================================================================================
Total params: 1,110,132
Trainable params: 18,426
Non-trainable params: 1,091,706
__________________________________________________________________________________________________
