Model: "Modele_SpeechReco_1600202399"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_12 (InputLayer)           [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 517, 13, 20)  120         input_12[0][0]                   
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 517, 13, 20)  80          conv2d_10[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_10 (MaxPooling2D) (None, 259, 7, 20)   0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 259, 7, 1)    101         max_pooling2d_10[0][0]           
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 259, 7, 1)    4           conv2d_11[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_11 (MaxPooling2D) (None, 130, 4, 1)    0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 130, 4)       0           max_pooling2d_11[0][0]           
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_5 (Bidirectional) [(None, 130, 64), (N 9472        squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 50)      2550        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_15 (TensorFl [(None, 64)]         0           bidirectional_5[0][1]            
                                                                 bidirectional_5[0][3]            
__________________________________________________________________________________________________
tf_op_layer_concat_16 (TensorFl [(None, 64)]         0           bidirectional_5[0][2]            
                                                                 bidirectional_5[0][4]            
__________________________________________________________________________________________________
lstm_11 (LSTM)                  [(None, 150, 64), (N 29440       decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_15[0][0]      
                                                                 tf_op_layer_concat_16[0][0]      
__________________________________________________________________________________________________
additive_attention_5 (AdditiveA (None, 150, 64)      0           lstm_11[0][0]                    
                                                                 bidirectional_5[0][0]            
__________________________________________________________________________________________________
tf_op_layer_concat_17 (TensorFl [(None, 150, 128)]   0           additive_attention_5[0][0]       
                                                                 lstm_11[0][0]                    
__________________________________________________________________________________________________
time_distributed_15 (TimeDistri (None, 150, 32)      4128        tf_op_layer_concat_17[0][0]      
__________________________________________________________________________________________________
time_distributed_16 (TimeDistri (None, 150, 16)      528         time_distributed_15[0][0]        
__________________________________________________________________________________________________
time_distributed_17 (TimeDistri (None, 150, 51)      867         time_distributed_16[0][0]        
==================================================================================================
Total params: 47,290
Trainable params: 47,248
Non-trainable params: 42
__________________________________________________________________________________________________
