Model: "Modele_SpeechReco_1600545544"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_10 (InputLayer)           [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 517, 13, 128) 768         input_10[0][0]                   
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 517, 13, 128) 512         conv2d_12[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_12 (MaxPooling2D) (None, 259, 7, 128)  0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 259, 7, 64)   41024       max_pooling2d_12[0][0]           
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 259, 7, 64)   256         conv2d_13[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_13 (MaxPooling2D) (None, 130, 4, 64)   0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 130, 4, 1)    321         max_pooling2d_13[0][0]           
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 130, 4, 1)    4           conv2d_14[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_14 (MaxPooling2D) (None, 65, 2, 1)     0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 65, 2)        0           max_pooling2d_14[0][0]           
__________________________________________________________________________________________________
bidirectional_8 (Bidirectional) [(None, 65, 256), (N 135168      squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 65, 256)      0           bidirectional_8[0][0]            
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_9 (Bidirectional) [(None, 65, 256), (N 395264      dropout_8[0][0]                  
                                                                 bidirectional_8[0][1]            
                                                                 bidirectional_8[0][3]            
                                                                 bidirectional_8[0][2]            
                                                                 bidirectional_8[0][4]            
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 100)     5100        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_12 (TensorFl [(None, 256)]        0           bidirectional_9[0][1]            
                                                                 bidirectional_9[0][3]            
__________________________________________________________________________________________________
tf_op_layer_concat_13 (TensorFl [(None, 256)]        0           bidirectional_9[0][2]            
                                                                 bidirectional_9[0][4]            
__________________________________________________________________________________________________
cu_dnnlstm_18 (CuDNNLSTM)       [(None, 150, 256), ( 366592      decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_12[0][0]      
                                                                 tf_op_layer_concat_13[0][0]      
__________________________________________________________________________________________________
cu_dnnlstm_19 (CuDNNLSTM)       [(None, 150, 256), ( 526336      cu_dnnlstm_18[0][0]              
                                                                 cu_dnnlstm_18[0][1]              
                                                                 cu_dnnlstm_18[0][2]              
__________________________________________________________________________________________________
additive_attention_4 (AdditiveA (None, 150, 256)     0           cu_dnnlstm_19[0][0]              
                                                                 bidirectional_9[0][0]            
__________________________________________________________________________________________________
tf_op_layer_concat_14 (TensorFl [(None, 150, 512)]   0           additive_attention_4[0][0]       
                                                                 cu_dnnlstm_19[0][0]              
__________________________________________________________________________________________________
time_distributed_16 (TimeDistri (None, 150, 128)     65664       tf_op_layer_concat_14[0][0]      
__________________________________________________________________________________________________
time_distributed_17 (TimeDistri (None, 150, 64)      8256        time_distributed_16[0][0]        
__________________________________________________________________________________________________
time_distributed_18 (TimeDistri (None, 150, 32)      2080        time_distributed_17[0][0]        
__________________________________________________________________________________________________
time_distributed_19 (TimeDistri (None, 150, 51)      1683        time_distributed_18[0][0]        
==================================================================================================
Total params: 1,549,028
Trainable params: 1,548,642
Non-trainable params: 386
__________________________________________________________________________________________________
