Model: "Modele_SpeechReco_1600437003"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_6 (InputLayer)            [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 517, 13, 20)  120         input_6[0][0]                    
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 517, 13, 20)  80          conv2d_6[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 259, 7, 20)   0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 259, 7, 1)    101         max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 259, 7, 1)    4           conv2d_7[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_7 (MaxPooling2D)  (None, 130, 4, 1)    0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 130, 4, 1)    6           max_pooling2d_7[0][0]            
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 130, 4, 1)    4           conv2d_8[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_8 (MaxPooling2D)  (None, 65, 2, 1)     0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 65, 2)        0           max_pooling2d_8[0][0]            
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) [(None, 65, 256), (N 134144      squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 50)      2550        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_6 (TensorFlo [(None, 256)]        0           bidirectional_2[0][1]            
                                                                 bidirectional_2[0][3]            
__________________________________________________________________________________________________
tf_op_layer_concat_7 (TensorFlo [(None, 256)]        0           bidirectional_2[0][2]            
                                                                 bidirectional_2[0][4]            
__________________________________________________________________________________________________
lstm_5 (LSTM)                   [(None, 150, 256), ( 314368      decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_6[0][0]       
                                                                 tf_op_layer_concat_7[0][0]       
__________________________________________________________________________________________________
dot_4 (Dot)                     (None, 150, 65)      0           lstm_5[0][0]                     
                                                                 bidirectional_2[0][0]            
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 150, 65)      0           dot_4[0][0]                      
__________________________________________________________________________________________________
dot_5 (Dot)                     (None, 150, 256)     0           activation_2[0][0]               
                                                                 bidirectional_2[0][0]            
__________________________________________________________________________________________________
tf_op_layer_concat_8 (TensorFlo [(None, 150, 512)]   0           dot_5[0][0]                      
                                                                 lstm_5[0][0]                     
__________________________________________________________________________________________________
time_distributed_6 (TimeDistrib (None, 150, 32)      16416       tf_op_layer_concat_8[0][0]       
__________________________________________________________________________________________________
time_distributed_7 (TimeDistrib (None, 150, 32)      1056        time_distributed_6[0][0]         
__________________________________________________________________________________________________
time_distributed_8 (TimeDistrib (None, 150, 51)      1683        time_distributed_7[0][0]         
==================================================================================================
Total params: 470,532
Trainable params: 470,488
Non-trainable params: 44
__________________________________________________________________________________________________
