Model: "Modele_SpeechReco_1600361983"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_4 (InputLayer)            [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 517, 13, 20)  120         input_4[0][0]                    
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 517, 13, 20)  80          conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 259, 7, 20)   0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 259, 7, 1)    101         max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 259, 7, 1)    4           conv2d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 130, 4, 1)    0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 130, 4)       0           max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) [(None, 130, 128), ( 35328       squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 50)      2550        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_3 (TensorFlo [(None, 128)]        0           bidirectional_1[0][1]            
                                                                 bidirectional_1[0][3]            
__________________________________________________________________________________________________
tf_op_layer_concat_4 (TensorFlo [(None, 128)]        0           bidirectional_1[0][2]            
                                                                 bidirectional_1[0][4]            
__________________________________________________________________________________________________
lstm_3 (LSTM)                   [(None, 150, 128), ( 91648       decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_3[0][0]       
                                                                 tf_op_layer_concat_4[0][0]       
__________________________________________________________________________________________________
attention_1 (Attention)         (None, 150, 128)     0           lstm_3[0][0]                     
                                                                 bidirectional_1[0][0]            
__________________________________________________________________________________________________
tf_op_layer_concat_5 (TensorFlo [(None, 150, 256)]   0           attention_1[0][0]                
                                                                 lstm_3[0][0]                     
__________________________________________________________________________________________________
time_distributed_3 (TimeDistrib (None, 150, 32)      8224        tf_op_layer_concat_5[0][0]       
__________________________________________________________________________________________________
time_distributed_4 (TimeDistrib (None, 150, 32)      1056        time_distributed_3[0][0]         
__________________________________________________________________________________________________
time_distributed_5 (TimeDistrib (None, 150, 51)      1683        time_distributed_4[0][0]         
==================================================================================================
Total params: 140,794
Trainable params: 140,752
Non-trainable params: 42
__________________________________________________________________________________________________
