Model: "Modele_SpeechReco_1600534132"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_6 (InputLayer)            [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 517, 13, 20)  120         input_6[0][0]                    
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 517, 13, 20)  80          conv2d_4[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 259, 7, 20)   0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 259, 7, 1)    101         max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 259, 7, 1)    4           conv2d_5[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 130, 4, 1)    0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 130, 4)       0           max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) [(None, 130, 512), ( 534528      squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 50)      2550        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_6 (TensorFlo [(None, 512)]        0           bidirectional_2[0][1]            
                                                                 bidirectional_2[0][3]            
__________________________________________________________________________________________________
tf_op_layer_concat_7 (TensorFlo [(None, 512)]        0           bidirectional_2[0][2]            
                                                                 bidirectional_2[0][4]            
__________________________________________________________________________________________________
lstm_7 (LSTM)                   [(None, 150, 512), ( 1153024     decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_6[0][0]       
                                                                 tf_op_layer_concat_7[0][0]       
__________________________________________________________________________________________________
lstm_8 (LSTM)                   [(None, 150, 512), ( 2099200     lstm_7[0][0]                     
                                                                 lstm_7[0][1]                     
                                                                 lstm_7[0][2]                     
__________________________________________________________________________________________________
additive_attention_2 (AdditiveA (None, 150, 512)     0           lstm_8[0][0]                     
                                                                 bidirectional_2[0][0]            
__________________________________________________________________________________________________
tf_op_layer_concat_8 (TensorFlo [(None, 150, 1024)]  0           additive_attention_2[0][0]       
                                                                 lstm_8[0][0]                     
__________________________________________________________________________________________________
time_distributed_6 (TimeDistrib (None, 150, 32)      32800       tf_op_layer_concat_8[0][0]       
__________________________________________________________________________________________________
time_distributed_7 (TimeDistrib (None, 150, 32)      1056        time_distributed_6[0][0]         
__________________________________________________________________________________________________
time_distributed_8 (TimeDistrib (None, 150, 51)      1683        time_distributed_7[0][0]         
==================================================================================================
Total params: 3,825,146
Trainable params: 3,825,104
Non-trainable params: 42
__________________________________________________________________________________________________
