Model: "Modele_SpeechReco_1600545798"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_10 (InputLayer)           [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 517, 13, 128) 768         input_10[0][0]                   
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 517, 13, 128) 512         conv2d_11[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_11 (MaxPooling2D) (None, 259, 7, 128)  0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 259, 7, 64)   41024       max_pooling2d_11[0][0]           
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 259, 7, 64)   256         conv2d_12[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_12 (MaxPooling2D) (None, 130, 4, 64)   0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 130, 4, 1)    321         max_pooling2d_12[0][0]           
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 130, 4, 1)    4           conv2d_13[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_13 (MaxPooling2D) (None, 65, 2, 1)     0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 65, 2)        0           max_pooling2d_13[0][0]           
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_4 (Bidirectional) [(None, 65, 128), (N 34816       squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 200)     10200       decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_12 (TensorFl [(None, 128)]        0           bidirectional_4[0][1]            
                                                                 bidirectional_4[0][3]            
__________________________________________________________________________________________________
tf_op_layer_concat_13 (TensorFl [(None, 128)]        0           bidirectional_4[0][2]            
                                                                 bidirectional_4[0][4]            
__________________________________________________________________________________________________
cu_dnnlstm_10 (CuDNNLSTM)       [(None, 150, 128), ( 168960      decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_12[0][0]      
                                                                 tf_op_layer_concat_13[0][0]      
__________________________________________________________________________________________________
additive_attention_4 (AdditiveA (None, 150, 128)     0           cu_dnnlstm_10[0][0]              
                                                                 bidirectional_4[0][0]            
__________________________________________________________________________________________________
tf_op_layer_concat_14 (TensorFl [(None, 150, 256)]   0           additive_attention_4[0][0]       
                                                                 cu_dnnlstm_10[0][0]              
__________________________________________________________________________________________________
time_distributed_15 (TimeDistri (None, 150, 128)     32896       tf_op_layer_concat_14[0][0]      
__________________________________________________________________________________________________
time_distributed_16 (TimeDistri (None, 150, 64)      8256        time_distributed_15[0][0]        
__________________________________________________________________________________________________
time_distributed_17 (TimeDistri (None, 150, 51)      3315        time_distributed_16[0][0]        
==================================================================================================
Total params: 301,328
Trainable params: 300,942
Non-trainable params: 386
__________________________________________________________________________________________________
