Model: "Modele_SpeechReco_1600532459"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_18 (InputLayer)           [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 517, 13, 20)  120         input_18[0][0]                   
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 517, 13, 20)  80          conv2d_16[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_16 (MaxPooling2D) (None, 259, 7, 20)   0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 259, 7, 1)    101         max_pooling2d_16[0][0]           
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 259, 7, 1)    4           conv2d_17[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_17 (MaxPooling2D) (None, 130, 4, 1)    0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 130, 4)       0           max_pooling2d_17[0][0]           
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_8 (Bidirectional) [(None, 130, 128), ( 35840       squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 50)      2550        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_24 (TensorFl [(None, 128)]        0           bidirectional_8[0][1]            
                                                                 bidirectional_8[0][3]            
__________________________________________________________________________________________________
tf_op_layer_concat_25 (TensorFl [(None, 128)]        0           bidirectional_8[0][2]            
                                                                 bidirectional_8[0][4]            
__________________________________________________________________________________________________
cu_dnnlstm_17 (CuDNNLSTM)       [(None, 150, 128), ( 92160       decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_24[0][0]      
                                                                 tf_op_layer_concat_25[0][0]      
__________________________________________________________________________________________________
dot_10 (Dot)                    (None, 150, 130)     0           cu_dnnlstm_17[0][0]              
                                                                 bidirectional_8[0][0]            
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 150, 130)     0           dot_10[0][0]                     
__________________________________________________________________________________________________
dot_11 (Dot)                    (None, 150, 128)     0           activation_5[0][0]               
                                                                 bidirectional_8[0][0]            
__________________________________________________________________________________________________
tf_op_layer_concat_26 (TensorFl [(None, 150, 256)]   0           dot_11[0][0]                     
                                                                 cu_dnnlstm_17[0][0]              
__________________________________________________________________________________________________
time_distributed_24 (TimeDistri (None, 150, 32)      8224        tf_op_layer_concat_26[0][0]      
__________________________________________________________________________________________________
time_distributed_25 (TimeDistri (None, 150, 32)      1056        time_distributed_24[0][0]        
__________________________________________________________________________________________________
time_distributed_26 (TimeDistri (None, 150, 51)      1683        time_distributed_25[0][0]        
==================================================================================================
Total params: 141,818
Trainable params: 141,776
Non-trainable params: 42
__________________________________________________________________________________________________
