Model: "Modele_SpeechReco_1600549861"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_20 (InputLayer)           [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 517, 13, 128) 768         input_20[0][0]                   
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 517, 13, 128) 512         conv2d_27[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_27 (MaxPooling2D) (None, 259, 7, 128)  0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 259, 7, 64)   41024       max_pooling2d_27[0][0]           
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 259, 7, 64)   256         conv2d_28[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_28 (MaxPooling2D) (None, 130, 4, 64)   0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 130, 4, 1)    321         max_pooling2d_28[0][0]           
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 130, 4, 1)    4           conv2d_29[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_29 (MaxPooling2D) (None, 65, 2, 1)     0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 65, 2)        0           max_pooling2d_29[0][0]           
__________________________________________________________________________________________________
bidirectional_18 (Bidirectional [(None, 65, 64), (No 9216        squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
dropout_18 (Dropout)            (None, 65, 64)       0           bidirectional_18[0][0]           
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_19 (Bidirectional [(None, 65, 64), (No 25088       dropout_18[0][0]                 
                                                                 bidirectional_18[0][1]           
                                                                 bidirectional_18[0][3]           
                                                                 bidirectional_18[0][2]           
                                                                 bidirectional_18[0][4]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 200)     10200       decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_27 (TensorFl [(None, 64)]         0           bidirectional_19[0][1]           
                                                                 bidirectional_19[0][3]           
__________________________________________________________________________________________________
tf_op_layer_concat_28 (TensorFl [(None, 64)]         0           bidirectional_19[0][2]           
                                                                 bidirectional_19[0][4]           
__________________________________________________________________________________________________
cu_dnnlstm_38 (CuDNNLSTM)       [(None, 150, 64), (N 68096       decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_27[0][0]      
                                                                 tf_op_layer_concat_28[0][0]      
__________________________________________________________________________________________________
cu_dnnlstm_39 (CuDNNLSTM)       [(None, 150, 64), (N 33280       cu_dnnlstm_38[0][0]              
                                                                 cu_dnnlstm_38[0][1]              
                                                                 cu_dnnlstm_38[0][2]              
__________________________________________________________________________________________________
additive_attention_9 (AdditiveA (None, 150, 64)      0           cu_dnnlstm_39[0][0]              
                                                                 bidirectional_19[0][0]           
__________________________________________________________________________________________________
tf_op_layer_concat_29 (TensorFl [(None, 150, 128)]   0           additive_attention_9[0][0]       
                                                                 cu_dnnlstm_39[0][0]              
__________________________________________________________________________________________________
time_distributed_33 (TimeDistri (None, 150, 64)      8256        tf_op_layer_concat_29[0][0]      
__________________________________________________________________________________________________
time_distributed_34 (TimeDistri (None, 150, 64)      4160        time_distributed_33[0][0]        
__________________________________________________________________________________________________
time_distributed_35 (TimeDistri (None, 150, 51)      3315        time_distributed_34[0][0]        
==================================================================================================
Total params: 204,496
Trainable params: 204,110
Non-trainable params: 386
__________________________________________________________________________________________________
