Model: "Modele_SpeechReco_1600549163"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_18 (InputLayer)           [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 517, 13, 128) 768         input_18[0][0]                   
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 517, 13, 128) 512         conv2d_24[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_24 (MaxPooling2D) (None, 259, 7, 128)  0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 259, 7, 64)   41024       max_pooling2d_24[0][0]           
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 259, 7, 64)   256         conv2d_25[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_25 (MaxPooling2D) (None, 130, 4, 64)   0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 130, 4, 1)    321         max_pooling2d_25[0][0]           
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 130, 4, 1)    4           conv2d_26[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_26 (MaxPooling2D) (None, 65, 2, 1)     0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 65, 2)        0           max_pooling2d_26[0][0]           
__________________________________________________________________________________________________
bidirectional_16 (Bidirectional [(None, 65, 64), (No 9216        squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
dropout_16 (Dropout)            (None, 65, 64)       0           bidirectional_16[0][0]           
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_17 (Bidirectional [(None, 65, 64), (No 25088       dropout_16[0][0]                 
                                                                 bidirectional_16[0][1]           
                                                                 bidirectional_16[0][3]           
                                                                 bidirectional_16[0][2]           
                                                                 bidirectional_16[0][4]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 200)     10200       decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_24 (TensorFl [(None, 64)]         0           bidirectional_17[0][1]           
                                                                 bidirectional_17[0][3]           
__________________________________________________________________________________________________
tf_op_layer_concat_25 (TensorFl [(None, 64)]         0           bidirectional_17[0][2]           
                                                                 bidirectional_17[0][4]           
__________________________________________________________________________________________________
cu_dnnlstm_34 (CuDNNLSTM)       [(None, 150, 64), (N 68096       decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_24[0][0]      
                                                                 tf_op_layer_concat_25[0][0]      
__________________________________________________________________________________________________
cu_dnnlstm_35 (CuDNNLSTM)       [(None, 150, 64), (N 33280       cu_dnnlstm_34[0][0]              
                                                                 cu_dnnlstm_34[0][1]              
                                                                 cu_dnnlstm_34[0][2]              
__________________________________________________________________________________________________
additive_attention_8 (AdditiveA (None, 150, 64)      0           cu_dnnlstm_35[0][0]              
                                                                 bidirectional_17[0][0]           
__________________________________________________________________________________________________
tf_op_layer_concat_26 (TensorFl [(None, 150, 128)]   0           additive_attention_8[0][0]       
                                                                 cu_dnnlstm_35[0][0]              
__________________________________________________________________________________________________
time_distributed_30 (TimeDistri (None, 150, 64)      8256        tf_op_layer_concat_26[0][0]      
__________________________________________________________________________________________________
time_distributed_31 (TimeDistri (None, 150, 64)      4160        time_distributed_30[0][0]        
__________________________________________________________________________________________________
time_distributed_32 (TimeDistri (None, 150, 51)      3315        time_distributed_31[0][0]        
==================================================================================================
Total params: 204,496
Trainable params: 204,110
Non-trainable params: 386
__________________________________________________________________________________________________
