Model: "Modele_SpeechReco_1600467602"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_8 (InputLayer)            [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 517, 13, 20)  120         input_8[0][0]                    
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 517, 13, 20)  80          conv2d_9[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_9 (MaxPooling2D)  (None, 259, 7, 20)   0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 259, 7, 1)    101         max_pooling2d_9[0][0]            
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 259, 7, 1)    4           conv2d_10[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_10 (MaxPooling2D) (None, 130, 4, 1)    0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 130, 4, 1)    6           max_pooling2d_10[0][0]           
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 130, 4, 1)    4           conv2d_11[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_11 (MaxPooling2D) (None, 65, 2, 1)     0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 65, 2)        0           max_pooling2d_11[0][0]           
__________________________________________________________________________________________________
bidirectional_6 (Bidirectional) [(None, 65, 16), (No 704         squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 65, 16)       0           bidirectional_6[0][0]            
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_7 (Bidirectional) [(None, 65, 16), (No 1600        dropout_6[0][0]                  
                                                                 bidirectional_6[0][1]            
                                                                 bidirectional_6[0][3]            
                                                                 bidirectional_6[0][2]            
                                                                 bidirectional_6[0][4]            
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 50)      2550        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_9 (TensorFlo [(None, 16)]         0           bidirectional_7[0][1]            
                                                                 bidirectional_7[0][3]            
__________________________________________________________________________________________________
tf_op_layer_concat_10 (TensorFl [(None, 16)]         0           bidirectional_7[0][2]            
                                                                 bidirectional_7[0][4]            
__________________________________________________________________________________________________
lstm_11 (LSTM)                  [(None, 150, 16), (N 4288        decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_9[0][0]       
                                                                 tf_op_layer_concat_10[0][0]      
__________________________________________________________________________________________________
dot_6 (Dot)                     (None, 150, 65)      0           lstm_11[0][0]                    
                                                                 bidirectional_7[0][0]            
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 150, 65)      0           dot_6[0][0]                      
__________________________________________________________________________________________________
dot_7 (Dot)                     (None, 150, 16)      0           activation_3[0][0]               
                                                                 bidirectional_7[0][0]            
__________________________________________________________________________________________________
tf_op_layer_concat_11 (TensorFl [(None, 150, 32)]    0           dot_7[0][0]                      
                                                                 lstm_11[0][0]                    
__________________________________________________________________________________________________
time_distributed_9 (TimeDistrib (None, 150, 32)      1056        tf_op_layer_concat_11[0][0]      
__________________________________________________________________________________________________
time_distributed_10 (TimeDistri (None, 150, 32)      1056        time_distributed_9[0][0]         
__________________________________________________________________________________________________
time_distributed_11 (TimeDistri (None, 150, 51)      1683        time_distributed_10[0][0]        
==================================================================================================
Total params: 13,252
Trainable params: 13,208
Non-trainable params: 44
__________________________________________________________________________________________________
