Model: "Modele_SpeechReco_1600300715"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_8 (InputLayer)            [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 517, 13, 20)  120         input_8[0][0]                    
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 517, 13, 20)  80          conv2d_6[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 259, 7, 20)   0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 259, 7, 1)    101         max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 259, 7, 1)    4           conv2d_7[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_7 (MaxPooling2D)  (None, 130, 4, 1)    0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 130, 4)       0           max_pooling2d_7[0][0]            
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_3 (Bidirectional) [(None, 130, 64), (N 9472        squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 50)      2550        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_9 (TensorFlo [(None, 64)]         0           bidirectional_3[0][1]            
                                                                 bidirectional_3[0][3]            
__________________________________________________________________________________________________
tf_op_layer_concat_10 (TensorFl [(None, 64)]         0           bidirectional_3[0][2]            
                                                                 bidirectional_3[0][4]            
__________________________________________________________________________________________________
lstm_7 (LSTM)                   [(None, 150, 64), (N 29440       decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_9[0][0]       
                                                                 tf_op_layer_concat_10[0][0]      
__________________________________________________________________________________________________
additive_attention_3 (AdditiveA (None, 150, 64)      0           lstm_7[0][0]                     
                                                                 bidirectional_3[0][0]            
__________________________________________________________________________________________________
tf_op_layer_concat_11 (TensorFl [(None, 150, 128)]   0           additive_attention_3[0][0]       
                                                                 lstm_7[0][0]                     
__________________________________________________________________________________________________
time_distributed_9 (TimeDistrib (None, 150, 32)      4128        tf_op_layer_concat_11[0][0]      
__________________________________________________________________________________________________
time_distributed_10 (TimeDistri (None, 150, 32)      1056        time_distributed_9[0][0]         
__________________________________________________________________________________________________
time_distributed_11 (TimeDistri (None, 150, 51)      1683        time_distributed_10[0][0]        
==================================================================================================
Total params: 48,634
Trainable params: 48,592
Non-trainable params: 42
__________________________________________________________________________________________________
