Model: "Modele_SpeechReco_1600538173"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_30 (InputLayer)           [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 517, 13, 100) 600         input_30[0][0]                   
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 517, 13, 100) 400         conv2d_28[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_28 (MaxPooling2D) (None, 259, 7, 100)  0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 259, 7, 1)    501         max_pooling2d_28[0][0]           
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 259, 7, 1)    4           conv2d_29[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_29 (MaxPooling2D) (None, 130, 4, 1)    0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 130, 4)       0           max_pooling2d_29[0][0]           
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_14 (Bidirectional [(None, 130, 512), ( 536576      squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 100)     5100        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_42 (TensorFl [(None, 512)]        0           bidirectional_14[0][1]           
                                                                 bidirectional_14[0][3]           
__________________________________________________________________________________________________
tf_op_layer_concat_43 (TensorFl [(None, 512)]        0           bidirectional_14[0][2]           
                                                                 bidirectional_14[0][4]           
__________________________________________________________________________________________________
cu_dnnlstm_34 (CuDNNLSTM)       [(None, 150, 512), ( 1257472     decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_42[0][0]      
                                                                 tf_op_layer_concat_43[0][0]      
__________________________________________________________________________________________________
cu_dnnlstm_35 (CuDNNLSTM)       [(None, 150, 512), ( 2101248     cu_dnnlstm_34[0][0]              
                                                                 cu_dnnlstm_34[0][1]              
                                                                 cu_dnnlstm_34[0][2]              
__________________________________________________________________________________________________
additive_attention_5 (AdditiveA (None, 150, 512)     0           cu_dnnlstm_35[0][0]              
                                                                 bidirectional_14[0][0]           
__________________________________________________________________________________________________
tf_op_layer_concat_44 (TensorFl [(None, 150, 1024)]  0           additive_attention_5[0][0]       
                                                                 cu_dnnlstm_35[0][0]              
__________________________________________________________________________________________________
time_distributed_47 (TimeDistri (None, 150, 64)      65600       tf_op_layer_concat_44[0][0]      
__________________________________________________________________________________________________
time_distributed_48 (TimeDistri (None, 150, 32)      2080        time_distributed_47[0][0]        
__________________________________________________________________________________________________
time_distributed_49 (TimeDistri (None, 150, 32)      1056        time_distributed_48[0][0]        
__________________________________________________________________________________________________
time_distributed_50 (TimeDistri (None, 150, 51)      1683        time_distributed_49[0][0]        
==================================================================================================
Total params: 3,972,320
Trainable params: 3,972,118
Non-trainable params: 202
__________________________________________________________________________________________________
