Model: "Modele_SpeechReco_1600538900"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_32 (InputLayer)           [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 517, 13, 128) 768         input_32[0][0]                   
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 517, 13, 128) 512         conv2d_30[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_30 (MaxPooling2D) (None, 259, 7, 128)  0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 259, 7, 64)   41024       max_pooling2d_30[0][0]           
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 259, 7, 64)   256         conv2d_31[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_31 (MaxPooling2D) (None, 130, 4, 64)   0           batch_normalization_31[0][0]     
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 130, 4, 1)    321         max_pooling2d_31[0][0]           
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 130, 4, 1)    4           conv2d_32[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_32 (MaxPooling2D) (None, 65, 2, 1)     0           batch_normalization_32[0][0]     
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 65, 2)        0           max_pooling2d_32[0][0]           
__________________________________________________________________________________________________
bidirectional_15 (Bidirectional [(None, 65, 256), (N 135168      squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
dropout_15 (Dropout)            (None, 65, 256)      0           bidirectional_15[0][0]           
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_16 (Bidirectional [(None, 65, 256), (N 395264      dropout_15[0][0]                 
                                                                 bidirectional_15[0][1]           
                                                                 bidirectional_15[0][3]           
                                                                 bidirectional_15[0][2]           
                                                                 bidirectional_15[0][4]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 100)     5100        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_45 (TensorFl [(None, 256)]        0           bidirectional_16[0][1]           
                                                                 bidirectional_16[0][3]           
__________________________________________________________________________________________________
tf_op_layer_concat_46 (TensorFl [(None, 256)]        0           bidirectional_16[0][2]           
                                                                 bidirectional_16[0][4]           
__________________________________________________________________________________________________
cu_dnnlstm_38 (CuDNNLSTM)       [(None, 150, 256), ( 366592      decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_45[0][0]      
                                                                 tf_op_layer_concat_46[0][0]      
__________________________________________________________________________________________________
cu_dnnlstm_39 (CuDNNLSTM)       [(None, 150, 256), ( 526336      cu_dnnlstm_38[0][0]              
                                                                 cu_dnnlstm_38[0][1]              
                                                                 cu_dnnlstm_38[0][2]              
__________________________________________________________________________________________________
additive_attention_6 (AdditiveA (None, 150, 256)     0           cu_dnnlstm_39[0][0]              
                                                                 bidirectional_16[0][0]           
__________________________________________________________________________________________________
tf_op_layer_concat_47 (TensorFl [(None, 150, 512)]   0           additive_attention_6[0][0]       
                                                                 cu_dnnlstm_39[0][0]              
__________________________________________________________________________________________________
time_distributed_51 (TimeDistri (None, 150, 128)     65664       tf_op_layer_concat_47[0][0]      
__________________________________________________________________________________________________
time_distributed_52 (TimeDistri (None, 150, 64)      8256        time_distributed_51[0][0]        
__________________________________________________________________________________________________
time_distributed_53 (TimeDistri (None, 150, 32)      2080        time_distributed_52[0][0]        
__________________________________________________________________________________________________
time_distributed_54 (TimeDistri (None, 150, 51)      1683        time_distributed_53[0][0]        
==================================================================================================
Total params: 1,549,028
Trainable params: 1,548,642
Non-trainable params: 386
__________________________________________________________________________________________________
