Model: "Modele_SpeechReco_1600541915"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_38 (InputLayer)           [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_39 (Conv2D)              (None, 517, 13, 128) 768         input_38[0][0]                   
__________________________________________________________________________________________________
batch_normalization_39 (BatchNo (None, 517, 13, 128) 512         conv2d_39[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_39 (MaxPooling2D) (None, 259, 7, 128)  0           batch_normalization_39[0][0]     
__________________________________________________________________________________________________
conv2d_40 (Conv2D)              (None, 259, 7, 64)   41024       max_pooling2d_39[0][0]           
__________________________________________________________________________________________________
batch_normalization_40 (BatchNo (None, 259, 7, 64)   256         conv2d_40[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_40 (MaxPooling2D) (None, 130, 4, 64)   0           batch_normalization_40[0][0]     
__________________________________________________________________________________________________
conv2d_41 (Conv2D)              (None, 130, 4, 1)    321         max_pooling2d_40[0][0]           
__________________________________________________________________________________________________
batch_normalization_41 (BatchNo (None, 130, 4, 1)    4           conv2d_41[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_41 (MaxPooling2D) (None, 65, 2, 1)     0           batch_normalization_41[0][0]     
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 65, 2)        0           max_pooling2d_41[0][0]           
__________________________________________________________________________________________________
bidirectional_21 (Bidirectional [(None, 65, 256), (N 135168      squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
dropout_21 (Dropout)            (None, 65, 256)      0           bidirectional_21[0][0]           
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_22 (Bidirectional [(None, 65, 256), (N 395264      dropout_21[0][0]                 
                                                                 bidirectional_21[0][1]           
                                                                 bidirectional_21[0][3]           
                                                                 bidirectional_21[0][2]           
                                                                 bidirectional_21[0][4]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 100)     5100        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_54 (TensorFl [(None, 256)]        0           bidirectional_22[0][1]           
                                                                 bidirectional_22[0][3]           
__________________________________________________________________________________________________
tf_op_layer_concat_55 (TensorFl [(None, 256)]        0           bidirectional_22[0][2]           
                                                                 bidirectional_22[0][4]           
__________________________________________________________________________________________________
cu_dnnlstm_50 (CuDNNLSTM)       [(None, 150, 256), ( 366592      decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_54[0][0]      
                                                                 tf_op_layer_concat_55[0][0]      
__________________________________________________________________________________________________
cu_dnnlstm_51 (CuDNNLSTM)       [(None, 150, 256), ( 526336      cu_dnnlstm_50[0][0]              
                                                                 cu_dnnlstm_50[0][1]              
                                                                 cu_dnnlstm_50[0][2]              
__________________________________________________________________________________________________
additive_attention_9 (AdditiveA (None, 150, 256)     0           cu_dnnlstm_51[0][0]              
                                                                 bidirectional_22[0][0]           
__________________________________________________________________________________________________
tf_op_layer_concat_56 (TensorFl [(None, 150, 512)]   0           additive_attention_9[0][0]       
                                                                 cu_dnnlstm_51[0][0]              
__________________________________________________________________________________________________
time_distributed_63 (TimeDistri (None, 150, 128)     65664       tf_op_layer_concat_56[0][0]      
__________________________________________________________________________________________________
time_distributed_64 (TimeDistri (None, 150, 64)      8256        time_distributed_63[0][0]        
__________________________________________________________________________________________________
time_distributed_65 (TimeDistri (None, 150, 32)      2080        time_distributed_64[0][0]        
__________________________________________________________________________________________________
time_distributed_66 (TimeDistri (None, 150, 51)      1683        time_distributed_65[0][0]        
==================================================================================================
Total params: 1,549,028
Trainable params: 1,548,642
Non-trainable params: 386
__________________________________________________________________________________________________
