Model: "Modele_SpeechReco_1600548343"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_16 (InputLayer)           [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 517, 13, 128) 768         input_16[0][0]                   
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 517, 13, 128) 512         conv2d_21[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_21 (MaxPooling2D) (None, 259, 7, 128)  0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 259, 7, 64)   41024       max_pooling2d_21[0][0]           
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 259, 7, 64)   256         conv2d_22[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_22 (MaxPooling2D) (None, 130, 4, 64)   0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 130, 4, 1)    321         max_pooling2d_22[0][0]           
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 130, 4, 1)    4           conv2d_23[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_23 (MaxPooling2D) (None, 65, 2, 1)     0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 65, 2)        0           max_pooling2d_23[0][0]           
__________________________________________________________________________________________________
bidirectional_14 (Bidirectional [(None, 65, 64), (No 9216        squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
dropout_14 (Dropout)            (None, 65, 64)       0           bidirectional_14[0][0]           
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_15 (Bidirectional [(None, 65, 64), (No 25088       dropout_14[0][0]                 
                                                                 bidirectional_14[0][1]           
                                                                 bidirectional_14[0][3]           
                                                                 bidirectional_14[0][2]           
                                                                 bidirectional_14[0][4]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 200)     10200       decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_21 (TensorFl [(None, 64)]         0           bidirectional_15[0][1]           
                                                                 bidirectional_15[0][3]           
__________________________________________________________________________________________________
tf_op_layer_concat_22 (TensorFl [(None, 64)]         0           bidirectional_15[0][2]           
                                                                 bidirectional_15[0][4]           
__________________________________________________________________________________________________
cu_dnnlstm_30 (CuDNNLSTM)       [(None, 150, 64), (N 68096       decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_21[0][0]      
                                                                 tf_op_layer_concat_22[0][0]      
__________________________________________________________________________________________________
cu_dnnlstm_31 (CuDNNLSTM)       [(None, 150, 64), (N 33280       cu_dnnlstm_30[0][0]              
                                                                 cu_dnnlstm_30[0][1]              
                                                                 cu_dnnlstm_30[0][2]              
__________________________________________________________________________________________________
additive_attention_7 (AdditiveA (None, 150, 64)      0           cu_dnnlstm_31[0][0]              
                                                                 bidirectional_15[0][0]           
__________________________________________________________________________________________________
tf_op_layer_concat_23 (TensorFl [(None, 150, 128)]   0           additive_attention_7[0][0]       
                                                                 cu_dnnlstm_31[0][0]              
__________________________________________________________________________________________________
time_distributed_27 (TimeDistri (None, 150, 64)      8256        tf_op_layer_concat_23[0][0]      
__________________________________________________________________________________________________
time_distributed_28 (TimeDistri (None, 150, 64)      4160        time_distributed_27[0][0]        
__________________________________________________________________________________________________
time_distributed_29 (TimeDistri (None, 150, 51)      3315        time_distributed_28[0][0]        
==================================================================================================
Total params: 204,496
Trainable params: 204,110
Non-trainable params: 386
__________________________________________________________________________________________________
