Model: "Modele_SpeechReco_1600544867"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_8 (InputLayer)            [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 517, 13, 128) 768         input_8[0][0]                    
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 517, 13, 128) 512         conv2d_9[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_9 (MaxPooling2D)  (None, 259, 7, 128)  0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 259, 7, 64)   41024       max_pooling2d_9[0][0]            
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 259, 7, 64)   256         conv2d_10[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_10 (MaxPooling2D) (None, 130, 4, 64)   0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 130, 4, 1)    321         max_pooling2d_10[0][0]           
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 130, 4, 1)    4           conv2d_11[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_11 (MaxPooling2D) (None, 65, 2, 1)     0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 65, 2)        0           max_pooling2d_11[0][0]           
__________________________________________________________________________________________________
bidirectional_6 (Bidirectional) [(None, 65, 256), (N 135168      squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 65, 256)      0           bidirectional_6[0][0]            
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_7 (Bidirectional) [(None, 65, 256), (N 395264      dropout_6[0][0]                  
                                                                 bidirectional_6[0][1]            
                                                                 bidirectional_6[0][3]            
                                                                 bidirectional_6[0][2]            
                                                                 bidirectional_6[0][4]            
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 100)     5100        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_9 (TensorFlo [(None, 256)]        0           bidirectional_7[0][1]            
                                                                 bidirectional_7[0][3]            
__________________________________________________________________________________________________
tf_op_layer_concat_10 (TensorFl [(None, 256)]        0           bidirectional_7[0][2]            
                                                                 bidirectional_7[0][4]            
__________________________________________________________________________________________________
cu_dnnlstm_14 (CuDNNLSTM)       [(None, 150, 256), ( 366592      decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_9[0][0]       
                                                                 tf_op_layer_concat_10[0][0]      
__________________________________________________________________________________________________
cu_dnnlstm_15 (CuDNNLSTM)       [(None, 150, 256), ( 526336      cu_dnnlstm_14[0][0]              
                                                                 cu_dnnlstm_14[0][1]              
                                                                 cu_dnnlstm_14[0][2]              
__________________________________________________________________________________________________
additive_attention_3 (AdditiveA (None, 150, 256)     0           cu_dnnlstm_15[0][0]              
                                                                 bidirectional_7[0][0]            
__________________________________________________________________________________________________
tf_op_layer_concat_11 (TensorFl [(None, 150, 512)]   0           additive_attention_3[0][0]       
                                                                 cu_dnnlstm_15[0][0]              
__________________________________________________________________________________________________
time_distributed_12 (TimeDistri (None, 150, 128)     65664       tf_op_layer_concat_11[0][0]      
__________________________________________________________________________________________________
time_distributed_13 (TimeDistri (None, 150, 64)      8256        time_distributed_12[0][0]        
__________________________________________________________________________________________________
time_distributed_14 (TimeDistri (None, 150, 32)      2080        time_distributed_13[0][0]        
__________________________________________________________________________________________________
time_distributed_15 (TimeDistri (None, 150, 51)      1683        time_distributed_14[0][0]        
==================================================================================================
Total params: 1,549,028
Trainable params: 1,548,642
Non-trainable params: 386
__________________________________________________________________________________________________
