Model: "Modele_SpeechReco_1600544102"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_6 (InputLayer)            [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 517, 13, 128) 768         input_6[0][0]                    
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 517, 13, 128) 512         conv2d_6[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 259, 7, 128)  0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 259, 7, 64)   41024       max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 259, 7, 64)   256         conv2d_7[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_7 (MaxPooling2D)  (None, 130, 4, 64)   0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 130, 4, 1)    321         max_pooling2d_7[0][0]            
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 130, 4, 1)    4           conv2d_8[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_8 (MaxPooling2D)  (None, 65, 2, 1)     0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 65, 2)        0           max_pooling2d_8[0][0]            
__________________________________________________________________________________________________
bidirectional_4 (Bidirectional) [(None, 65, 256), (N 135168      squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 65, 256)      0           bidirectional_4[0][0]            
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_5 (Bidirectional) [(None, 65, 256), (N 395264      dropout_4[0][0]                  
                                                                 bidirectional_4[0][1]            
                                                                 bidirectional_4[0][3]            
                                                                 bidirectional_4[0][2]            
                                                                 bidirectional_4[0][4]            
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 100)     5100        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_6 (TensorFlo [(None, 256)]        0           bidirectional_5[0][1]            
                                                                 bidirectional_5[0][3]            
__________________________________________________________________________________________________
tf_op_layer_concat_7 (TensorFlo [(None, 256)]        0           bidirectional_5[0][2]            
                                                                 bidirectional_5[0][4]            
__________________________________________________________________________________________________
cu_dnnlstm_10 (CuDNNLSTM)       [(None, 150, 256), ( 366592      decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_6[0][0]       
                                                                 tf_op_layer_concat_7[0][0]       
__________________________________________________________________________________________________
cu_dnnlstm_11 (CuDNNLSTM)       [(None, 150, 256), ( 526336      cu_dnnlstm_10[0][0]              
                                                                 cu_dnnlstm_10[0][1]              
                                                                 cu_dnnlstm_10[0][2]              
__________________________________________________________________________________________________
additive_attention_2 (AdditiveA (None, 150, 256)     0           cu_dnnlstm_11[0][0]              
                                                                 bidirectional_5[0][0]            
__________________________________________________________________________________________________
tf_op_layer_concat_8 (TensorFlo [(None, 150, 512)]   0           additive_attention_2[0][0]       
                                                                 cu_dnnlstm_11[0][0]              
__________________________________________________________________________________________________
time_distributed_8 (TimeDistrib (None, 150, 128)     65664       tf_op_layer_concat_8[0][0]       
__________________________________________________________________________________________________
time_distributed_9 (TimeDistrib (None, 150, 64)      8256        time_distributed_8[0][0]         
__________________________________________________________________________________________________
time_distributed_10 (TimeDistri (None, 150, 32)      2080        time_distributed_9[0][0]         
__________________________________________________________________________________________________
time_distributed_11 (TimeDistri (None, 150, 51)      1683        time_distributed_10[0][0]        
==================================================================================================
Total params: 1,549,028
Trainable params: 1,548,642
Non-trainable params: 386
__________________________________________________________________________________________________
