Model: "Modele_SpeechReco_1600535045"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_26 (InputLayer)           [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 517, 13, 100) 600         input_26[0][0]                   
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 517, 13, 100) 400         conv2d_24[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_24 (MaxPooling2D) (None, 259, 7, 100)  0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 259, 7, 1)    501         max_pooling2d_24[0][0]           
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 259, 7, 1)    4           conv2d_25[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_25 (MaxPooling2D) (None, 130, 4, 1)    0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 130, 4)       0           max_pooling2d_25[0][0]           
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_12 (Bidirectional [(None, 130, 512), ( 536576      squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 100)     5100        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_36 (TensorFl [(None, 512)]        0           bidirectional_12[0][1]           
                                                                 bidirectional_12[0][3]           
__________________________________________________________________________________________________
tf_op_layer_concat_37 (TensorFl [(None, 512)]        0           bidirectional_12[0][2]           
                                                                 bidirectional_12[0][4]           
__________________________________________________________________________________________________
cu_dnnlstm_28 (CuDNNLSTM)       [(None, 150, 512), ( 1257472     decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_36[0][0]      
                                                                 tf_op_layer_concat_37[0][0]      
__________________________________________________________________________________________________
cu_dnnlstm_29 (CuDNNLSTM)       [(None, 150, 512), ( 2101248     cu_dnnlstm_28[0][0]              
                                                                 cu_dnnlstm_28[0][1]              
                                                                 cu_dnnlstm_28[0][2]              
__________________________________________________________________________________________________
additive_attention_3 (AdditiveA (None, 150, 512)     0           cu_dnnlstm_29[0][0]              
                                                                 bidirectional_12[0][0]           
__________________________________________________________________________________________________
tf_op_layer_concat_38 (TensorFl [(None, 150, 1024)]  0           additive_attention_3[0][0]       
                                                                 cu_dnnlstm_29[0][0]              
__________________________________________________________________________________________________
time_distributed_39 (TimeDistri (None, 150, 64)      65600       tf_op_layer_concat_38[0][0]      
__________________________________________________________________________________________________
time_distributed_40 (TimeDistri (None, 150, 32)      2080        time_distributed_39[0][0]        
__________________________________________________________________________________________________
time_distributed_41 (TimeDistri (None, 150, 32)      1056        time_distributed_40[0][0]        
__________________________________________________________________________________________________
time_distributed_42 (TimeDistri (None, 150, 51)      1683        time_distributed_41[0][0]        
==================================================================================================
Total params: 3,972,320
Trainable params: 3,972,118
Non-trainable params: 202
__________________________________________________________________________________________________
