Model: "Modele_SpeechReco_1600361703"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 517, 13, 20)  120         input_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 517, 13, 20)  80          conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 259, 7, 20)   0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 259, 7, 1)    101         max_pooling2d[0][0]              
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 259, 7, 1)    4           conv2d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 130, 4, 1)    0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 130, 4)       0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional (Bidirectional)   [(None, 130, 128), ( 35328       squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 50)      2550        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat (TensorFlowO [(None, 128)]        0           bidirectional[0][1]              
                                                                 bidirectional[0][3]              
__________________________________________________________________________________________________
tf_op_layer_concat_1 (TensorFlo [(None, 128)]        0           bidirectional[0][2]              
                                                                 bidirectional[0][4]              
__________________________________________________________________________________________________
lstm_1 (LSTM)                   [(None, 150, 128), ( 91648       decoder_embedding[0][0]          
                                                                 tf_op_layer_concat[0][0]         
                                                                 tf_op_layer_concat_1[0][0]       
__________________________________________________________________________________________________
attention (Attention)           (None, 150, 128)     0           lstm_1[0][0]                     
                                                                 bidirectional[0][0]              
__________________________________________________________________________________________________
tf_op_layer_concat_2 (TensorFlo [(None, 150, 256)]   0           attention[0][0]                  
                                                                 lstm_1[0][0]                     
__________________________________________________________________________________________________
time_distributed (TimeDistribut (None, 150, 32)      8224        tf_op_layer_concat_2[0][0]       
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 150, 32)      1056        time_distributed[0][0]           
__________________________________________________________________________________________________
time_distributed_2 (TimeDistrib (None, 150, 51)      1683        time_distributed_1[0][0]         
==================================================================================================
Total params: 140,794
Trainable params: 140,752
Non-trainable params: 42
__________________________________________________________________________________________________
