Model: "Modele_SpeechReco_1599608109"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_10 (InputLayer)           [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 517, 13, 20)  120         input_10[0][0]                   
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 517, 13, 20)  80          conv2d_8[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_8 (MaxPooling2D)  (None, 259, 7, 20)   0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 259, 7, 1)    101         max_pooling2d_8[0][0]            
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 259, 7, 1)    4           conv2d_9[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_9 (MaxPooling2D)  (None, 130, 4, 1)    0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 130, 4)       0           max_pooling2d_9[0][0]            
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_4 (Bidirectional) [(None, 130, 16), (N 832         squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 32)      1632        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_12 (TensorFl [(None, 16)]         0           bidirectional_4[0][1]            
                                                                 bidirectional_4[0][3]            
__________________________________________________________________________________________________
tf_op_layer_concat_13 (TensorFl [(None, 16)]         0           bidirectional_4[0][2]            
                                                                 bidirectional_4[0][4]            
__________________________________________________________________________________________________
lstm_9 (LSTM)                   [(None, 150, 16), (N 3136        decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_12[0][0]      
                                                                 tf_op_layer_concat_13[0][0]      
__________________________________________________________________________________________________
additive_attention_4 (AdditiveA (None, 150, 16)      0           lstm_9[0][0]                     
                                                                 bidirectional_4[0][0]            
__________________________________________________________________________________________________
tf_op_layer_concat_14 (TensorFl [(None, 150, 32)]    0           additive_attention_4[0][0]       
                                                                 lstm_9[0][0]                     
__________________________________________________________________________________________________
time_distributed_12 (TimeDistri (None, 150, 32)      1056        tf_op_layer_concat_14[0][0]      
__________________________________________________________________________________________________
time_distributed_13 (TimeDistri (None, 150, 16)      528         time_distributed_12[0][0]        
__________________________________________________________________________________________________
time_distributed_14 (TimeDistri (None, 150, 51)      867         time_distributed_13[0][0]        
==================================================================================================
Total params: 8,356
Trainable params: 8,314
Non-trainable params: 42
__________________________________________________________________________________________________
