Model: "Modele_SpeechReco_1600543155"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_42 (InputLayer)           [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_45 (Conv2D)              (None, 517, 13, 128) 768         input_42[0][0]                   
__________________________________________________________________________________________________
batch_normalization_45 (BatchNo (None, 517, 13, 128) 512         conv2d_45[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_45 (MaxPooling2D) (None, 259, 7, 128)  0           batch_normalization_45[0][0]     
__________________________________________________________________________________________________
conv2d_46 (Conv2D)              (None, 259, 7, 64)   41024       max_pooling2d_45[0][0]           
__________________________________________________________________________________________________
batch_normalization_46 (BatchNo (None, 259, 7, 64)   256         conv2d_46[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_46 (MaxPooling2D) (None, 130, 4, 64)   0           batch_normalization_46[0][0]     
__________________________________________________________________________________________________
conv2d_47 (Conv2D)              (None, 130, 4, 1)    321         max_pooling2d_46[0][0]           
__________________________________________________________________________________________________
batch_normalization_47 (BatchNo (None, 130, 4, 1)    4           conv2d_47[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_47 (MaxPooling2D) (None, 65, 2, 1)     0           batch_normalization_47[0][0]     
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 65, 2)        0           max_pooling2d_47[0][0]           
__________________________________________________________________________________________________
bidirectional_25 (Bidirectional [(None, 65, 256), (N 135168      squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
dropout_25 (Dropout)            (None, 65, 256)      0           bidirectional_25[0][0]           
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_26 (Bidirectional [(None, 65, 256), (N 395264      dropout_25[0][0]                 
                                                                 bidirectional_25[0][1]           
                                                                 bidirectional_25[0][3]           
                                                                 bidirectional_25[0][2]           
                                                                 bidirectional_25[0][4]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 100)     5100        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_60 (TensorFl [(None, 256)]        0           bidirectional_26[0][1]           
                                                                 bidirectional_26[0][3]           
__________________________________________________________________________________________________
tf_op_layer_concat_61 (TensorFl [(None, 256)]        0           bidirectional_26[0][2]           
                                                                 bidirectional_26[0][4]           
__________________________________________________________________________________________________
cu_dnnlstm_58 (CuDNNLSTM)       [(None, 150, 256), ( 366592      decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_60[0][0]      
                                                                 tf_op_layer_concat_61[0][0]      
__________________________________________________________________________________________________
cu_dnnlstm_59 (CuDNNLSTM)       [(None, 150, 256), ( 526336      cu_dnnlstm_58[0][0]              
                                                                 cu_dnnlstm_58[0][1]              
                                                                 cu_dnnlstm_58[0][2]              
__________________________________________________________________________________________________
additive_attention_11 (Additive (None, 150, 256)     0           cu_dnnlstm_59[0][0]              
                                                                 bidirectional_26[0][0]           
__________________________________________________________________________________________________
tf_op_layer_concat_62 (TensorFl [(None, 150, 512)]   0           additive_attention_11[0][0]      
                                                                 cu_dnnlstm_59[0][0]              
__________________________________________________________________________________________________
time_distributed_71 (TimeDistri (None, 150, 128)     65664       tf_op_layer_concat_62[0][0]      
__________________________________________________________________________________________________
time_distributed_72 (TimeDistri (None, 150, 64)      8256        time_distributed_71[0][0]        
__________________________________________________________________________________________________
time_distributed_73 (TimeDistri (None, 150, 32)      2080        time_distributed_72[0][0]        
__________________________________________________________________________________________________
time_distributed_74 (TimeDistri (None, 150, 51)      1683        time_distributed_73[0][0]        
==================================================================================================
Total params: 1,549,028
Trainable params: 1,548,642
Non-trainable params: 386
__________________________________________________________________________________________________
