Model: "Modele_SpeechReco_1600547626"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_14 (InputLayer)           [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 517, 13, 128) 768         input_14[0][0]                   
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 517, 13, 128) 512         conv2d_18[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_18 (MaxPooling2D) (None, 259, 7, 128)  0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 259, 7, 64)   41024       max_pooling2d_18[0][0]           
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 259, 7, 64)   256         conv2d_19[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_19 (MaxPooling2D) (None, 130, 4, 64)   0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 130, 4, 1)    321         max_pooling2d_19[0][0]           
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 130, 4, 1)    4           conv2d_20[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_20 (MaxPooling2D) (None, 65, 2, 1)     0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 65, 2)        0           max_pooling2d_20[0][0]           
__________________________________________________________________________________________________
bidirectional_12 (Bidirectional [(None, 65, 64), (No 9216        squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
dropout_12 (Dropout)            (None, 65, 64)       0           bidirectional_12[0][0]           
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_13 (Bidirectional [(None, 65, 64), (No 25088       dropout_12[0][0]                 
                                                                 bidirectional_12[0][1]           
                                                                 bidirectional_12[0][3]           
                                                                 bidirectional_12[0][2]           
                                                                 bidirectional_12[0][4]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 200)     10200       decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_18 (TensorFl [(None, 64)]         0           bidirectional_13[0][1]           
                                                                 bidirectional_13[0][3]           
__________________________________________________________________________________________________
tf_op_layer_concat_19 (TensorFl [(None, 64)]         0           bidirectional_13[0][2]           
                                                                 bidirectional_13[0][4]           
__________________________________________________________________________________________________
cu_dnnlstm_26 (CuDNNLSTM)       [(None, 150, 64), (N 68096       decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_18[0][0]      
                                                                 tf_op_layer_concat_19[0][0]      
__________________________________________________________________________________________________
cu_dnnlstm_27 (CuDNNLSTM)       [(None, 150, 64), (N 33280       cu_dnnlstm_26[0][0]              
                                                                 cu_dnnlstm_26[0][1]              
                                                                 cu_dnnlstm_26[0][2]              
__________________________________________________________________________________________________
additive_attention_6 (AdditiveA (None, 150, 64)      0           cu_dnnlstm_27[0][0]              
                                                                 bidirectional_13[0][0]           
__________________________________________________________________________________________________
tf_op_layer_concat_20 (TensorFl [(None, 150, 128)]   0           additive_attention_6[0][0]       
                                                                 cu_dnnlstm_27[0][0]              
__________________________________________________________________________________________________
time_distributed_24 (TimeDistri (None, 150, 64)      8256        tf_op_layer_concat_20[0][0]      
__________________________________________________________________________________________________
time_distributed_25 (TimeDistri (None, 150, 64)      4160        time_distributed_24[0][0]        
__________________________________________________________________________________________________
time_distributed_26 (TimeDistri (None, 150, 51)      3315        time_distributed_25[0][0]        
==================================================================================================
Total params: 204,496
Trainable params: 204,110
Non-trainable params: 386
__________________________________________________________________________________________________
