Model: "Modele_SpeechReco_1600531058"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_14 (InputLayer)           [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 517, 13, 20)  120         input_14[0][0]                   
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 517, 13, 20)  80          conv2d_12[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_12 (MaxPooling2D) (None, 259, 7, 20)   0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 259, 7, 1)    101         max_pooling2d_12[0][0]           
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 259, 7, 1)    4           conv2d_13[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_13 (MaxPooling2D) (None, 130, 4, 1)    0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 130, 4)       0           max_pooling2d_13[0][0]           
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_6 (Bidirectional) [(None, 130, 128), ( 35840       squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 50)      2550        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_18 (TensorFl [(None, 128)]        0           bidirectional_6[0][1]            
                                                                 bidirectional_6[0][3]            
__________________________________________________________________________________________________
tf_op_layer_concat_19 (TensorFl [(None, 128)]        0           bidirectional_6[0][2]            
                                                                 bidirectional_6[0][4]            
__________________________________________________________________________________________________
cu_dnnlstm_13 (CuDNNLSTM)       [(None, 150, 128), ( 92160       decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_18[0][0]      
                                                                 tf_op_layer_concat_19[0][0]      
__________________________________________________________________________________________________
dot_6 (Dot)                     (None, 150, 130)     0           cu_dnnlstm_13[0][0]              
                                                                 bidirectional_6[0][0]            
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 150, 130)     0           dot_6[0][0]                      
__________________________________________________________________________________________________
dot_7 (Dot)                     (None, 150, 128)     0           activation_3[0][0]               
                                                                 bidirectional_6[0][0]            
__________________________________________________________________________________________________
tf_op_layer_concat_20 (TensorFl [(None, 150, 256)]   0           dot_7[0][0]                      
                                                                 cu_dnnlstm_13[0][0]              
__________________________________________________________________________________________________
time_distributed_18 (TimeDistri (None, 150, 32)      8224        tf_op_layer_concat_20[0][0]      
__________________________________________________________________________________________________
time_distributed_19 (TimeDistri (None, 150, 32)      1056        time_distributed_18[0][0]        
__________________________________________________________________________________________________
time_distributed_20 (TimeDistri (None, 150, 51)      1683        time_distributed_19[0][0]        
==================================================================================================
Total params: 141,818
Trainable params: 141,776
Non-trainable params: 42
__________________________________________________________________________________________________
