Model: "Modele_SpeechReco_1600530561"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_12 (InputLayer)           [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 517, 13, 20)  120         input_12[0][0]                   
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 517, 13, 20)  80          conv2d_10[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_10 (MaxPooling2D) (None, 259, 7, 20)   0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 259, 7, 1)    101         max_pooling2d_10[0][0]           
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 259, 7, 1)    4           conv2d_11[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_11 (MaxPooling2D) (None, 130, 4, 1)    0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 130, 4)       0           max_pooling2d_11[0][0]           
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_5 (Bidirectional) [(None, 130, 128), ( 35840       squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 50)      2550        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_15 (TensorFl [(None, 128)]        0           bidirectional_5[0][1]            
                                                                 bidirectional_5[0][3]            
__________________________________________________________________________________________________
tf_op_layer_concat_16 (TensorFl [(None, 128)]        0           bidirectional_5[0][2]            
                                                                 bidirectional_5[0][4]            
__________________________________________________________________________________________________
cu_dnnlstm_11 (CuDNNLSTM)       [(None, 150, 128), ( 92160       decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_15[0][0]      
                                                                 tf_op_layer_concat_16[0][0]      
__________________________________________________________________________________________________
dot_4 (Dot)                     (None, 150, 130)     0           cu_dnnlstm_11[0][0]              
                                                                 bidirectional_5[0][0]            
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 150, 130)     0           dot_4[0][0]                      
__________________________________________________________________________________________________
dot_5 (Dot)                     (None, 150, 128)     0           activation_2[0][0]               
                                                                 bidirectional_5[0][0]            
__________________________________________________________________________________________________
tf_op_layer_concat_17 (TensorFl [(None, 150, 256)]   0           dot_5[0][0]                      
                                                                 cu_dnnlstm_11[0][0]              
__________________________________________________________________________________________________
time_distributed_15 (TimeDistri (None, 150, 32)      8224        tf_op_layer_concat_17[0][0]      
__________________________________________________________________________________________________
time_distributed_16 (TimeDistri (None, 150, 32)      1056        time_distributed_15[0][0]        
__________________________________________________________________________________________________
time_distributed_17 (TimeDistri (None, 150, 51)      1683        time_distributed_16[0][0]        
==================================================================================================
Total params: 141,818
Trainable params: 141,776
Non-trainable params: 42
__________________________________________________________________________________________________
