Model: "Modele_SpeechReco_1600532039"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_16 (InputLayer)           [(None, 517, 13, 1)] 0                                            
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 517, 13, 20)  120         input_16[0][0]                   
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 517, 13, 20)  80          conv2d_14[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_14 (MaxPooling2D) (None, 259, 7, 20)   0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 259, 7, 1)    101         max_pooling2d_14[0][0]           
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 259, 7, 1)    4           conv2d_15[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_15 (MaxPooling2D) (None, 130, 4, 1)    0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 130, 4)       0           max_pooling2d_15[0][0]           
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional_7 (Bidirectional) [(None, 130, 128), ( 35840       squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 50)      2550        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat_21 (TensorFl [(None, 128)]        0           bidirectional_7[0][1]            
                                                                 bidirectional_7[0][3]            
__________________________________________________________________________________________________
tf_op_layer_concat_22 (TensorFl [(None, 128)]        0           bidirectional_7[0][2]            
                                                                 bidirectional_7[0][4]            
__________________________________________________________________________________________________
cu_dnnlstm_15 (CuDNNLSTM)       [(None, 150, 128), ( 92160       decoder_embedding[0][0]          
                                                                 tf_op_layer_concat_21[0][0]      
                                                                 tf_op_layer_concat_22[0][0]      
__________________________________________________________________________________________________
dot_8 (Dot)                     (None, 150, 130)     0           cu_dnnlstm_15[0][0]              
                                                                 bidirectional_7[0][0]            
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 150, 130)     0           dot_8[0][0]                      
__________________________________________________________________________________________________
dot_9 (Dot)                     (None, 150, 128)     0           activation_4[0][0]               
                                                                 bidirectional_7[0][0]            
__________________________________________________________________________________________________
tf_op_layer_concat_23 (TensorFl [(None, 150, 256)]   0           dot_9[0][0]                      
                                                                 cu_dnnlstm_15[0][0]              
__________________________________________________________________________________________________
time_distributed_21 (TimeDistri (None, 150, 32)      8224        tf_op_layer_concat_23[0][0]      
__________________________________________________________________________________________________
time_distributed_22 (TimeDistri (None, 150, 32)      1056        time_distributed_21[0][0]        
__________________________________________________________________________________________________
time_distributed_23 (TimeDistri (None, 150, 51)      1683        time_distributed_22[0][0]        
==================================================================================================
Total params: 141,818
Trainable params: 141,776
Non-trainable params: 42
__________________________________________________________________________________________________
