Model: "Modele_SpeechReco_1599561100"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 264600)]     0                                            
__________________________________________________________________________________________________
reshape (Reshape)               (None, 1, 264600)    0           input_2[0][0]                    
__________________________________________________________________________________________________
mel_stft (Melspectrogram)       (None, 80, 2068, 1)  1091664     reshape[0][0]                    
__________________________________________________________________________________________________
mel_stft_norm (Normalization2D) (None, 80, 2068, 1)  0           mel_stft[0][0]                   
__________________________________________________________________________________________________
permute (Permute)               (None, 2068, 80, 1)  0           mel_stft_norm[0][0]              
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 2068, 80, 20) 120         permute[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 2068, 80, 20) 80          conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 1034, 40, 20) 0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 1034, 40, 10) 1010        max_pooling2d[0][0]              
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 1034, 40, 10) 40          conv2d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 517, 20, 10)  0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 517, 20, 1)   51          max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 517, 20, 1)   4           conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 259, 10, 1)   0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, 259, 10)      0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, 150)]        0                                            
__________________________________________________________________________________________________
bidirectional (Bidirectional)   [(None, 259, 16), (N 1216        squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
decoder_embedding (Embedding)   (None, 150, 32)      1632        decoder_inputs[0][0]             
__________________________________________________________________________________________________
tf_op_layer_concat (TensorFlowO [(None, 16)]         0           bidirectional[0][1]              
                                                                 bidirectional[0][3]              
__________________________________________________________________________________________________
tf_op_layer_concat_1 (TensorFlo [(None, 16)]         0           bidirectional[0][2]              
                                                                 bidirectional[0][4]              
__________________________________________________________________________________________________
lstm_1 (LSTM)                   [(None, 150, 16), (N 3136        decoder_embedding[0][0]          
                                                                 tf_op_layer_concat[0][0]         
                                                                 tf_op_layer_concat_1[0][0]       
__________________________________________________________________________________________________
additive_attention (AdditiveAtt (None, 150, 16)      0           lstm_1[0][0]                     
                                                                 bidirectional[0][0]              
__________________________________________________________________________________________________
tf_op_layer_concat_2 (TensorFlo [(None, 150, 32)]    0           additive_attention[0][0]         
                                                                 lstm_1[0][0]                     
__________________________________________________________________________________________________
time_distributed (TimeDistribut (None, 150, 32)      1056        tf_op_layer_concat_2[0][0]       
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 150, 16)      528         time_distributed[0][0]           
__________________________________________________________________________________________________
time_distributed_2 (TimeDistrib (None, 150, 51)      867         time_distributed_1[0][0]         
==================================================================================================
Total params: 1,101,404
Trainable params: 9,678
Non-trainable params: 1,091,726
__________________________________________________________________________________________________
